class Wine < ApplicationRecord
    mount_uploader :image, ImageUploader
    
    validates :name, presence: true
    # enum color: { "" => 0, "スパークリング" => 1, "ロゼ" => 2, "白" => 3, "赤" => 4, "オレンジ" => 5 }
    # enum body: { "" => 0, "ライトボディ" => 1, "ミディアムボディ" => 2, "フルボディ" => 3 }
    enum grape_variety: { 
        "" => 0, 
        "カベルネ・ソーヴィニヨン" => 1, 
        "カベルネ・フラン" => 2, 
        "ガメイ" => 3,
        "カリニャン" => 4,
        "カルメネール" => 5,
        "グルナッシュ" => 6,
        "サンジョベーゼ" => 7,
        "シラー" => 8,
        "ジンファンデル" => 9,
        "テンプラニーリョ" => 10,
        "ネッビオーロ" => 11,
        "ピノ・ノワール" => 12,
        "マスカット・ベーリーA" => 13,
        "メルロー" => 14,
        "モンテプルチャーノ" => 15,

        "アルバリーニョ" => 16,
        "ヴィオニエ" => 17,
        "ゲヴュルツトラミネール" => 18,
        "甲州" => 19,
        "シャルドネ" => 20,
        "シュナン・ブラン" => 21,
        "セミヨン" => 22,
        "ソーヴィニヨン・ブラン" => 23,
        "ピノ・グリ" => 24,
        "ピノ・ブラン" => 25,
        "フィアーノ" => 26,
        "モスカート" => 27,
        "リースリング" => 28,
     }


end
